src/DataProcessors/Scan_ЗаполнениеТарифовДоставкиДляДилеров/Scan_ЗаполнениеТарифовДоставкиДляДилеров.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>Scan_ЗаполнениеТарифовДоставкиДляДилеров</name>
</mdclass:DataProcessor>

src/InformationRegisters/Scan_РасстояниеМеждуАдресами/Scan_РасстояниеМеждуАдресами.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>Scan_РасстояниеМеждуАдресами</name>
  <resources>
    <name>Расстояние</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>7</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <attributes>
    <name>Пользователь</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <dimensions>
    <name>АдресПолучения</name>
    <type>
      <types>CatalogRef.Scan_АдресаХранения</types>
    </type>
  </dimensions>
  <dimensions>
    <name>АдресДоставки</name>
    <type>
      <types>CatalogRef.Scan_АдресаХранения</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/InformationRegisters/Scan_МатрицаТарифовПоДоставкеИзделий/Scan_МатрицаТарифовПоДоставкеИзделий.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>Scan_МатрицаТарифовПоДоставкеИзделий</name>
  <informationRegisterPeriodicity>Second</informationRegisterPeriodicity>
  <resources>
    <name>Сумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>СуммаНДС</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>СуммаСНДС</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Стоимость1Км</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <attributes>
    <name>Пользователь</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <dimensions>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Scan_Контрагенты</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ДоговорКонтрагента</name>
    <type>
      <types>CatalogRef.Scan_ДоговорыВзаиморасчетов</types>
    </type>
  </dimensions>
  <dimensions>
    <name>НоменклатураУслуги</name>
    <type>
      <types>CatalogRef.Scan_НоменклатураУслуг</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ГруппаПродукта</name>
    <type>
      <types>CatalogRef.Scan_ГруппыПродуктов</types>
    </type>
  </dimensions>
  <dimensions>
    <name>СтавкаНДС</name>
    <type>
      <types>CatalogRef.Scan_СтавкиНДС</types>
    </type>
  </dimensions>
  <dimensions>
    <name>СпособДоставки</name>
    <type>
      <types>EnumRef.Scan_СпособыДоставкиПродуктов</types>
    </type>
  </dimensions>
  <dimensions>
    <name>АдресПолучения</name>
    <type>
      <types>CatalogRef.Scan_АдресаХранения</types>
    </type>
  </dimensions>
  <dimensions>
    <name>АдресДоставки</name>
    <type>
      <types>CatalogRef.Scan_АдресаХранения</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ЛогистическийТип</name>
    <type>
      <types>CatalogRef.Scan_ТипыПродуктовЛогистика</types>
    </type>
  </dimensions>
  <dimensions>
    <name>КолеснаяФормула</name>
    <type>
      <types>CatalogRef.Scan_КолесныеФормулыИзделий</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/InformationRegisters/Scan_СтоимостьУслугДляРасчетаСтоимостиДоставки/Scan_СтоимостьУслугДляРасчетаСтоимостиДоставки.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>Scan_СтоимостьУслугДляРасчетаСтоимостиДоставки</name>
  <informationRegisterPeriodicity>Day</informationRegisterPeriodicity>
  <resources>
    <name>Стоимость</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <attributes>
    <name>ОсновнаяУслуга</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Пользователь</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <dimensions>
    <name>Услуга</name>
    <type>
      <types>CatalogRef.Scan_НоменклатураУслуг</types>
    </type>
  </dimensions>
  <dimensions>
    <name>СпособДоставки</name>
    <type>
      <types>EnumRef.Scan_СпособыДоставкиПродуктов</types>
    </type>
  </dimensions>
  <dimensions>
    <name>АдресПолучения</name>
    <type>
      <types>CatalogRef.Scan_АдресаХранения</types>
    </type>
  </dimensions>
  <dimensions>
    <name>АдресДоставки</name>
    <type>
      <types>CatalogRef.Scan_АдресаХранения</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/InformationRegisters/Scan_МатрицаТарифовДляДилеровПоДоставкеИзделий/Scan_МатрицаТарифовДляДилеровПоДоставкеИзделий.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>Scan_МатрицаТарифовДляДилеровПоДоставкеИзделий</name>
  <informationRegisterPeriodicity>Second</informationRegisterPeriodicity>
  <resources>
    <name>Стоимость</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <attributes>
    <name>ТарифУказанВручную</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Пользователь</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <dimensions>
    <name>УслугаПакета</name>
    <type>
      <types>CatalogRef.Scan_НоменклатураУслуг</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ЛогистическийТип</name>
    <type>
      <types>CatalogRef.Scan_ТипыПродуктовЛогистика</types>
    </type>
  </dimensions>
  <dimensions>
    <name>СпособДоставки</name>
    <type>
      <types>EnumRef.Scan_СпособыДоставкиПродуктов</types>
    </type>
  </dimensions>
  <dimensions>
    <name>КолеснаяФормула</name>
    <type>
      <types>CatalogRef.Scan_КолесныеФормулыИзделий</types>
    </type>
  </dimensions>
  <dimensions>
    <name>АдресПолучения</name>
    <type>
      <types>CatalogRef.Scan_АдресаХранения</types>
    </type>
  </dimensions>
  <dimensions>
    <name>АдресДоставки</name>
    <type>
      <types>CatalogRef.Scan_АдресаХранения</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/Catalogs/Scan_МестаХранения/Scan_МестаХранения.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Scan_МестаХранения</name>
  <comment>Места хранения (отгрузки, доставки)</comment>
  <hierarchical>true</hierarchical>
  <predefined>
    <items>
      <name>Маршруты</name>
      <description>Маршруты</description>
    </items>
    <items>
      <name>МестаХраненияАдресаКлиентов</name>
      <description>Места хранения – адреса клиентов</description>
    </items>
    <items>
      <name>МестаХранения</name>
      <description>Места хранения (площадки)</description>
    </items>
  </predefined>
  <attributes>
    <name>IDExternalSystem</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>АдресСкладаЛогистический</name>
    <type>
      <types>CatalogRef.Scan_АдресаХранения</types>
    </type>
  </attributes>
  <attributes>
    <name>АдресСкладаФактический</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>БуквенныйКод</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>3</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОбновления</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗарубежныйКузовостроитель</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИсходныйПункт</name>
    <type>
      <types>CatalogRef.Scan_МестаХранения</types>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоПродуктовНаПлощадке</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КонечныйПункт</name>
    <type>
      <types>CatalogRef.Scan_МестаХранения</types>
    </type>
  </attributes>
  <attributes>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Scan_Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>КраткоеНаименование</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Маршрут</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Недействительный</name>
    <comment>Место хранения больше не используется в программе, но сведения о нем сохранены. Недействительные места хранения скрываются из всех списков при выборе или подборе в документах, и других местах программы.</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПроверятьНаличиеВ1БД</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>СкладПроизводителя</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>СтанцияДилера</name>
    <type>
      <types>CatalogRef.Scan_Компании</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипСклада</name>
    <type>
      <types>EnumRef.Scan_ТипыСклада</types>
    </type>
  </attributes>
  <attributes>
    <name>ФормироватьЧекЛисты</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоИспользований</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>11</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НеЗапрещатьПеремещениеМестаХранения</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>СрокиДоставки</name>
    <attributes>
      <name>СрокДоставки</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>3</precision>
          <scale>1</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СпособДоставки</name>
      <type>
        <types>EnumRef.Scan_СпособыДоставкиПродуктов</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

src/Catalogs/Scan_СтавкиНДС/Scan_СтавкиНДС.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Scan_СтавкиНДС</name>
  <predefined>
    <items>
      <name>ОсновнаяСтавкаНДС</name>
      <description>18%</description>
    </items>
    <items>
      <name>ОсновнаяСтавкаНДССтарая</name>
      <description>20%</description>
    </items>
    <items>
      <name>БезНДС</name>
      <description>Без НДС</description>
    </items>
  </predefined>
  <attributes>
    <name>Ставка</name>
    <comment>Ставка налога на добавленную стоимость</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>4</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
</mdclass:Catalog>

src/DataProcessors/Scan_ЗаполнениеТарифовДоставкиДляДилеров/Forms/ФормаСтарая/Module.bsl
//rarus abrant 14.06.2017 mantis 9146 +++
&НаКлиенте
Процедура ЗаполнитьМатрицу(Команда)
	ВсеОК = Истина;
	Если НЕ ЗначениеЗаполнено(МестоПолучения) Тогда
		//rarus FominskiyAS 24.04.2019  mantis 14191 +++
		//Сообщить("Пожалуйста, заполните поле 'Место получения'");
		Сообщить(НСтр("ru = 'Пожалуйста, заполните поле ''Место получения'''; en = 'Please add ""Delivery point"" '"));
		//rarus FominskiyAS 24.04.2019  mantis 14191 ---  
		ВсеОК = Ложь;
	КонецЕсли;
	Если НЕ ЗначениеЗаполнено(ДатаУстановкиТарифа) Тогда
		//rarus FominskiyAS 24.04.2019  mantis 14191 +++
		//Сообщить("Пожалуйста, заполните поле 'Дата установки тарифа'");
		Сообщить(НСтр("ru = 'Пожалуйста, заполните поле ''Дата установки тарифа'''; en = 'Please add ""Tariff date""'"));
		//rarus FominskiyAS 24.04.2019  mantis 14191 ---  
		ВсеОК = Ложь;
	КонецЕсли;
	Если ВсеОК Тогда
		ЗаполнитьМатрицуНаСервере();
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьМатрицуНаСервере()
	СуммаОсновнойУслуги = 0;
	СуммаУслуг = 0;
	Для Каждого НоменклатураУслуга Из ДействующиеУслуги Цикл
		Если НоменклатураУслуга.ОсновнаяУслуга Тогда
			СуммаОсновнойУслуги = НоменклатураУслуга.Стоимость;
		Иначе
			СуммаУслуг = СуммаУслуг + НоменклатураУслуга.Стоимость; 
		КонецЕсли;
	КонецЦикла;
	
	МатрицаТарифов.Очистить();
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ РАЗЛИЧНЫЕ
	               |	Scan_МестаХранения.ИсходныйПункт.АдресСкладаЛогистический КАК АдресПолучения,
	               |	Scan_МестаХранения.КонечныйПункт.АдресСкладаЛогистический КАК АдресДоставки
	               |ПОМЕСТИТЬ АдресаХранения
	               |ИЗ
	               |	Справочник.Scan_МестаХранения КАК Scan_МестаХранения
	               |ГДЕ
	               |	Scan_МестаХранения.Маршрут = ИСТИНА
	               |	И Scan_МестаХранения.ИсходныйПункт.АдресСкладаЛогистический <> ЗНАЧЕНИЕ(Справочник.Scan_АдресаХранения.ПустаяСсылка)
	               |	И Scan_МестаХранения.КонечныйПункт.АдресСкладаЛогистический <> ЗНАЧЕНИЕ(Справочник.Scan_АдресаХранения.ПустаяСсылка)
	               |	И Scan_МестаХранения.ИсходныйПункт.АдресСкладаЛогистический = &МестоПолучения
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	Scan_МестаХранения.ИсходныйПункт.АдресСкладаЛогистический,
	               |	Scan_МестаХранения.КонечныйПункт.АдресСкладаЛогистический
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	АдресаХранения.АдресПолучения,
	               |	АдресаХранения.АдресДоставки,
	               |	Scan_РасстояниеМеждуАдресами.Расстояние
	               |ПОМЕСТИТЬ Расстояния
	               |ИЗ
	               |	АдресаХранения КАК АдресаХранения
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.Scan_РасстояниеМеждуАдресами КАК Scan_РасстояниеМеждуАдресами
	               |		ПО АдресаХранения.АдресПолучения = Scan_РасстояниеМеждуАдресами.АдресПолучения
	               |			И АдресаХранения.АдресДоставки = Scan_РасстояниеМеждуАдресами.АдресДоставки
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	АдресаХранения.АдресПолучения,
	               |	АдресаХранения.АдресДоставки,
	               |	Scan_КолесныеФормулыИзделий.Ссылка КАК КолеснаяФормула,
	               |	Scan_СпособыДоставкиПродуктов.Ссылка КАК СпособДоставки,
	               |	Scan_ТипыПродуктовЛогистика.Ссылка КАК ЛогистическийТип
	               |ПОМЕСТИТЬ Варианты
	               |ИЗ
	               |	АдресаХранения КАК АдресаХранения,
	               |	Справочник.Scan_КолесныеФормулыИзделий КАК Scan_КолесныеФормулыИзделий,
	               |	Справочник.Scan_ТипыПродуктовЛогистика КАК Scan_ТипыПродуктовЛогистика,
	               |	Перечисление.Scan_СпособыДоставкиПродуктов КАК Scan_СпособыДоставкиПродуктов
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	Варианты.АдресПолучения,
	               |	Варианты.АдресДоставки,
	               |	Варианты.КолеснаяФормула,
	               |	Варианты.СпособДоставки,
	               |	Варианты.ЛогистическийТип,
	               |	Расстояния.Расстояние,
	               |	МАКСИМУМ(Scan_МатрицаТарифовПоДоставкеИзделийСрезПоследних.Стоимость1Км) КАК Стоимость1Км
	               |ИЗ
	               |	Варианты КАК Варианты
	               |		ЛЕВОЕ СОЕДИНЕНИЕ Расстояния КАК Расстояния
	               |		ПО Варианты.АдресПолучения = Расстояния.АдресПолучения
	               |			И Варианты.АдресДоставки = Расстояния.АдресДоставки
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.Scan_МатрицаТарифовПоДоставкеИзделий.СрезПоследних(&ДатаУстановкиТарифа, ) КАК Scan_МатрицаТарифовПоДоставкеИзделийСрезПоследних
	               |		ПО Варианты.АдресПолучения = Scan_МатрицаТарифовПоДоставкеИзделийСрезПоследних.АдресПолучения
	               |			И Варианты.АдресДоставки = Scan_МатрицаТарифовПоДоставкеИзделийСрезПоследних.АдресДоставки
	               |			И Варианты.КолеснаяФормула = Scan_МатрицаТарифовПоДоставкеИзделийСрезПоследних.КолеснаяФормула
	               |			И Варианты.СпособДоставки = Scan_МатрицаТарифовПоДоставкеИзделийСрезПоследних.СпособДоставки
	               |			И Варианты.ЛогистическийТип = Scan_МатрицаТарифовПоДоставкеИзделийСрезПоследних.ЛогистическийТип
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	Варианты.СпособДоставки,
	               |	Варианты.АдресПолучения,
	               |	Варианты.КолеснаяФормула,
	               |	Варианты.АдресДоставки,
	               |	Варианты.ЛогистическийТип,
	               |	Расстояния.Расстояние";
	
	Запрос.УстановитьПараметр("МестоПолучения", МестоПолучения);
	Запрос.УстановитьПараметр("ДатаУстановкиТарифа", ДатаУстановкиТарифа);
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	н=0;
	м=0;
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Тариф = МатрицаТарифов.Добавить();
		ЗаполнитьЗначенияСвойств(Тариф,ВыборкаДетальныеЗаписи);
		Если ЗначениеЗаполнено(ВыборкаДетальныеЗаписи.Расстояние) 	И ВыборкаДетальныеЗаписи.Расстояние 	> 0 И 
			 ЗначениеЗаполнено(ВыборкаДетальныеЗаписи.Стоимость1км) И ВыборкаДетальныеЗаписи.Стоимость1км 	> 0 И
			 Перегон > 0 И
			 ВыборкаДетальныеЗаписи.Расстояние > Перегон Тогда
			// rarus tenkam 24.12.2018 mantis 13896 +++    		
			//Тариф.Стоимость = Окр(((ВыборкаДетальныеЗаписи.Расстояние - Перегон)*ВыборкаДетальныеЗаписи.Стоимость1км+СуммаОсновнойУслуги)*1.18+СуммаУслуг,-2);	 
			Тариф.Стоимость = Окр(((ВыборкаДетальныеЗаписи.Расстояние - Перегон)*ВыборкаДетальныеЗаписи.Стоимость1км+СуммаОсновнойУслуги)*(1 + Справочники.Scan_СтавкиНДС.ОсновнаяСтавкаНДС.Ставка/100)+СуммаУслуг,-2);
			// rarus tenkam 24.12.2018 mantis 13896 ---    		
			н=н+1;	
		КонецЕсли;
		м=м+1;
	КонецЦикла;
	к=0;

КонецПроцедуры

&НаКлиенте
Процедура МестоПолученияПриИзменении(Элемент)	
	Матрица.Параметры.УстановитьЗначениеПараметра("МестоПолучения", МестоПолучения);
КонецПроцедуры

&НаКлиенте
Процедура ДатаУстановкиТарифаПриИзменении(Элемент)
	//ДействующиеУслугиНаДатуУстановкиТарифа.Параметры.УстановитьЗначениеПараметра("Дата", ДатаУстановкиТарифа);
	ДатаУстановкиТарифаПриИзмененииНаСервере();		
КонецПроцедуры

&НаСервере
Процедура ДатаУстановкиТарифаПриИзмененииНаСервере()
	ДействующиеУслуги.Очистить();
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	РегистрСведенийScan_СтоимостьУслугДляРасчетаСтоимостиДоставкиСрезПоследних.Услуга,
	               |	РегистрСведенийScan_СтоимостьУслугДляРасчетаСтоимостиДоставкиСрезПоследних.Стоимость,
	               |	РегистрСведенийScan_СтоимостьУслугДляРасчетаСтоимостиДоставкиСрезПоследних.ОсновнаяУслуга
	               |ИЗ
	               |	РегистрСведений.Scan_СтоимостьУслугДляРасчетаСтоимостиДоставки.СрезПоследних(&Дата, ) КАК РегистрСведенийScan_СтоимостьУслугДляРасчетаСтоимостиДоставкиСрезПоследних
	               |ГДЕ
	               |	РегистрСведенийScan_СтоимостьУслугДляРасчетаСтоимостиДоставкиСрезПоследних.ИспользуетсяВРасчетах = ИСТИНА";
	Запрос.УстановитьПараметр("Дата", ДатаУстановкиТарифа);
	РезультатЗапроса = Запрос.Выполнить();	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Услуга = ДействующиеУслуги.Добавить();
		ЗаполнитьЗначенияСвойств(Услуга,ВыборкаДетальныеЗаписи);
	КонецЦикла;
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ДействующиеУслугиНаДатуУстановкиТарифа.Параметры.УстановитьЗначениеПараметра("Дата", Дата("00010102"));
	Перегон = Scan_ПраваИНастройки.Scan_Право("ЛьготноеРасстояниеПриДоставке");
	Матрица.Параметры.УстановитьЗначениеПараметра("МестоПолучения", Справочники.Scan_АдресаХранения.ПустаяСсылка());
КонецПроцедуры

&НаКлиенте
Процедура МатрицаТарифовСтоимостьПриИзменении(Элемент)
	Элементы.МатрицаТарифов.ТекущиеДанные.Вручную = Истина;
КонецПроцедуры

&НаКлиенте
Процедура ВыполнитьКоманду(Команда)
	ВыполнитьКомандуНаСервере();	
КонецПроцедуры

&НаСервере
Процедура ВыполнитьКомандуНаСервере()
	н=0;
	Для каждого Тариф из МатрицаТарифов.Выгрузить() Цикл
		Если Тариф.Стоимость > 0 Тогда
			МенеджерЗаписи = РегистрыСведений.Scan_МатрицаТарифовДляДилеровПоДоставкеИзделий.СоздатьМенеджерЗаписи();
			МенеджерЗаписи.Период 				= ДатаУстановкиТарифа;
			МенеджерЗаписи.АдресПолучения 		= Тариф.АдресПолучения;
			МенеджерЗаписи.АдресДоставки 		= Тариф.АдресДоставки;
			МенеджерЗаписи.Стоимость 			= Тариф.Стоимость;
			МенеджерЗаписи.КолеснаяФормула 		= Тариф.КолеснаяФормула;
			МенеджерЗаписи.ЛогистическийТип 	= Тариф.ЛогистическийТип;
			МенеджерЗаписи.СпособДоставки 		= Тариф.СпособДоставки;
			МенеджерЗаписи.ТарифУказанВручную 	= Тариф.Вручную;
			МенеджерЗаписи.Пользователь 		= ПользователиКлиентСервер.ТекущийПользователь();
			МенеджерЗаписи.Записать();
			н=н+1;
		КонецЕсли;
	КонецЦикла;
	//rarus FominskiyAS 24.04.2019  mantis 14191 +++
	//Сообщить("Записаны " + н + " тарифов для дилеров по доставке изделий.");
	Сообщить(НСтр("ru = 'Записаны '; en = ' '") + н + НСтр("ru = ' тарифов для дилеров по доставке продуктов.'; en = 'dealer transportation tariff saved'"));
	//rarus FominskiyAS 24.04.2019  mantis 14191 ---  
КонецПроцедуры


//&НаСервере
//Процедура ОчиститьНаСервере()
//	НаборЗаписей = РегистрыСведений.Scan_МатрицаТарифовПоДоставкеИзделий.СоздатьНаборЗаписей();
//	НаборЗаписей.Записать();
//КонецПроцедуры

//&НаКлиенте
//Процедура Очистить(Команда)
//	ОчиститьНаСервере();
//КонецПроцедуры

//rarus abrant 14.06.2017 mantis 9146 ---
